Repository: Snaipe/Criterion
Catalog: po/*.po
Languages: fr

source: %1$s::%2$s: Test is disabled
fr: %1$s::%2$s: Le test est désactivé

source: %1$s::%2$s: Suite is disabled
fr: %1$s::%2$s: La suite est désactivée

source: %1$s%2$s%3$s:%4$s%5$d%6$s: Assertion failed: %7$s
fr: %1$s%2$s%3$s:%4$s%5$d%6$s: Échec d'assertion: %7$s

source: %1$s%2$s%3$s:%4$s%5$u%6$s: Unexpected signal caught below this line!
fr: %1$s%2$s%3$s:%4$s%5$u%6$s: Un signal inattendu a été reçu après cette ligne!

source: %1$s::%2$s: CRASH!
fr: %1$s::%2$s: PLANTAGE!

source: Running %1$s%2$lu%3$s test from %4$s%5$s%6$s:
fr: Lancement de %1$s%2$lu%3$s test dans %4$s%5$s%6$s:

source: %1$sSynthesis: Tested: %2$s%3$lu%4$s | Passing: %5$s%6$lu%7$s | Failing: %8$s%9$lu%10$s | Crashing: %11$s%12$lu%13$s %14$s
fr: %1$sSynthèse: Testés: %2$s%3$lu%4$s | Validés: %5$s%6$lu%7$s | Échoués: %8$s%9$lu%10$s | Plantages: %11$s%12$lu%13$s %14$s

source: The conditions for this assertion were not met.
fr: Les conditions de cette assertion n'ont pas été remplies.

source: The expression %s is false.
fr: L'expression %s est fausse.

source: The expression (as strings) %s is false.
fr: L'expression (en tant que chaînes de caractères) %s est fausse.

source: %s is null.
fr: %s est nul.

source: %s is not null.
fr: %s n'est pas nul.

source: %s is empty.
fr: %s est vide.

source: %s is not empty.
fr: %s n'est pas vide.

source: The file contents of %1$s does not match the string "%2$s".
fr: Le contenu du fichier %1$s ne correspond pas à la chaine de caractères "%2$s".

source: The statement `%1$s` did throw an instance of the `%2$s` exception.
fr: L'instruction `%1$s` a levé une instance de l'exception `%2$s`.

source: The statement `%1$s` did not throw an instance of the `%2$s` exception.
fr: L'instruction `%1$s` n'a pas levé d'instance de l'exception `%2$s`.
